#include"main.h"

//*******************************************************************************************************************************************
//                                            Урок 5. Совместное использование функций и методов в С++
//
//    Реализовать класс Pair, который позволяет использовать разные типы данных в передаваемых парах.
//    Следующий код :
//     int main(){
//
//	        Pair<int, double> p1(6, 7.8);
//	        cout << "Pair: " << p1.first() << ' ' << p1.second() << '\n';
//
//	        const Pair<double, int> p2(3.4, 5);
//	        cout << "Pair: " << p2.first() << ' ' << p2.second() << '\n';
//
//	        return 0;
//}
//
//         … должен производить следующий результат :
//         Pair: 6 7.8
//	       Pair : 3.4 5
//     	Подсказка : чтобы определить шаблон с использованием двух разных типов, просто разделите параметры типа шаблона запятой.

//*******************************************************************************************************************************************

using namespace std;

template<class T, class D>
class Pair{
public:
	Pair(T a, D b) : num1(a), num2(b) {

	}
	T first()  const { return num1; }
	D second() const { return num2; }

	~Pair(){}

private:
	T num1;
	D num2;
};














//*******************************************************************************************************************************************
int main(){
	setlocale(LC_ALL, "rus");
	Pair<int, double> p1(6, 7.8);

	cout << "Pair: " << p1.first() << ' ' << p1.second() << '\n';
	
	const Pair<double, int> p2(3.4, 5);
	cout << "Pair: " << p2.first() << ' ' << p2.second() << '\n';
	

system("pause");
return 0;
}
