#include"main.h"

//*******************************************************************************************************************************************
//                                Урок 4. Отношения между объектами в С++
//
//    Дан вектор чисел(числа вводятся с клавиатуры), требуется выяснить, сколько среди них различных.
//    Постараться использовать максимально быстрый алгоритм.
//*******************************************************************************************************************************************

using namespace std;

int main(){

	setlocale(LC_ALL, "rus");
	vector <int> vec_int;
	int N;
	cout << "Сколько чисел вы хотите ввести ? "; cin >> N;
	while (N > 0){
		int digit;
		N--;
		cout << "Введите число ";
		cin >> digit;
		vec_int.push_back(digit);
	} 

	set<int> s(vec_int.begin(), vec_int.end());                                // контейнер, который автоматически сортирует добавляемые элементы
	cout << endl;
	cout << "Всего различных чмсел = " << s.size() << endl << "Вот они : ";

	copy(s.begin(), s.end(), ostream_iterator<int>(cout, " "));
	cout << endl;
	system("pause");
	return 0;
}