#include"main.h"

//*******************************************************************************************************************************************
//                                            ”рок 5. —овместное использование функций и методов в —++
//
// Ќаписать шаблон класса StringValuePair, в котором первое значение всегда типа string, а второе Ч любого типа.Ётот шаблон класса должен наследовать 
// частично специализированный класс Pair, в котором первый параметр Ч string, а второй Ч любого типа данных.
//
//   —ледующий код :
//  int main(){
//
//	StringValuePair<int> svp("Amazing", 7);
//	std::cout << "Pair: " << svp.first() << ' ' << svp.second() << '\n';
//	return 0;
//  }
//
//Е должен производить следующий результат :
//Pair: Amazing 7
//	ѕодсказка : при вызове конструктора класса Pair из конструктора класса StringValuePair не забудьте указать, что параметры относ€тс€ к классу Pair.

//*******************************************************************************************************************************************

using namespace std;



//*******************************************************************************************************************************************
int main(){
	setlocale(LC_ALL, "rus");

	StringValuePair<int> svp("Amazing", 7);
	cout << "Pair: " << svp.first() << ' ' << svp.second() << '\n';
		
	cout << endl;


system("pause");
return 0;
}
