#include"main.h"

//*******************************************************************************************************************************************
//                                            Урок 6. Потоки ввода-вывода в С++
//
//   Создать программу, которая считывает целое число типа int.И поставить «защиту от дурака» : если пользователь вводит что - то кроме
//   одного целочисленного значения, нужно вывести сообщение об ошибке и предложить ввести число еще раз.Пример неправильных введенных строк :
//       rbtrb
//       nj34njkn
//        1n
//
//*******************************************************************************************************************************************

using namespace std;




//*******************************************************************************************************************************************
int main(){
	setlocale(LC_ALL, "rus");
	int count = 0;
	while (true) {
		count++;
		string strName;
		cout << "Введите число  : ";
		getline(cin, strName);
		size_t found = strName.find_first_not_of("0123456789");
		if (found != string::npos)
		{
			 cout << "Это не число!!!" << endl;
			 count--;
		}

		if (count > 5) 
		{
			char strQ;	
			cout << "Хотите еще раз ввести число ? Y/N ";
			strQ = getchar();			
			if (strQ != 'Y' && strQ != 'y' ) break;
			cin.ignore();
			count = 0;
		}
		
		if (count > 50)
		{
			cout << "Займитесь чем нибудь более интересным" << endl;
			break;
		}
    }
system("pause");
return 0;
}

