#include"main.h"

//*******************************************************************************************************************************************
//                                            Урок 5. Совместное использование функций и методов в С++
//
// Реализовать шаблон класса Pair1, который позволяет пользователю передавать данные одного типа парами.
//      Следующий код :
//     int main(){
//
//	      Pair1<int> p1(6, 9);
//	      cout << "Pair: " << p1.first() << ' ' << p1.second() << '\n';
//
//	      const Pair1<double> p2(3.4, 7.8);
//	      cout << "Pair: " << p2.first() << ' ' << p2.second() << '\n';
//
//	      return 0;
//     }
//
//    … должен производить результат :
//  Pair: 6 9
//	Pair : 3.4 7.8

//*******************************************************************************************************************************************

using namespace std;

template<class T>
class Pairl {
public:
	Pairl(T a, T b): num1(a), num2(b) {
		
	}

	T first()  const { return num1; }
	T second() const { return num2; }

	~Pairl(){}
private:
	T num1;
	T num2;
};

//*******************************************************************************************************************************************
int main(){
	setlocale(LC_ALL, "rus");

	
    Pairl<int> p1(6, 9);
    cout << "Pair: " << p1.first() << ' ' << p1.second() << '\n';
	
    const Pairl<double> p2(3.4, 7.8);
    cout << "Pair: " << p2.first() << ' ' << p2.second() << '\n';
	cout << endl;


system("pause");
return 0;
}
