#include"main.h"

//*******************************************************************************************************************************************
//                                            Урок 6. Потоки ввода-вывода в С++
//
//  Создать собственный манипулятор endll для стандартного потока вывода, который выводит два перевода строки и сбрасывает буфер.
//
//*******************************************************************************************************************************************

using namespace std;

//class Output {
//public:
//	Output(){	}
//
//	~Output() {}
//	//friend ostream& operator<< (ostream& out, const Output& );
//};


//ostream& operator<< (ostream& out, const Output& ){
//	out << "\n\n";
//	return out;
//}

ostream& endll(ostream& out) {
	out << "\n\n";
	return out;

}

//*******************************************************************************************************************************************
int main(){
	setlocale(LC_ALL, "rus");
	
	cout << "*****************" << endl;
	cout << "Новый манипулятор "<< endll;
	cout << endll;	
	cout << "ввода вывода!!" << endl;

system("pause");
return 0;
}

